# Einführung in Pandas

## Datenstrukturen
### Series

Eine Series ist ein eindimensionales Array mit einem Index.

In [4]:
import pandas as pd

obj = pd.Series([4,7,-5,3])
obj # links sieht man den Index, rechts die Werte

0    4
1    7
2   -5
3    3
dtype: int64

In [14]:
obj2 = pd.Series([4,7,-5,3], index=['d', 'b', 'a', 'c' ])
obj2

d    4
b    7
a   -5
c    3
dtype: int64

In [15]:
obj2.index

Index(['d', 'b', 'a', 'c'], dtype='object')

In [16]:
obj2['a']

-5

In [9]:
obj2['d'] = 6
obj2

d    6
b    7
a   -5
c    3
dtype: int64

In [21]:
obj2[obj2 > 0] # filtern
obj2 * 2       # multiplizieren

d     8
b    14
a   -10
c     6
dtype: int64

## DataFrame
Ein DataFrame ist eine tabellarische Datenstruktur, die **unterschiedliche** Datentypen haben können. Ein DataFrame besitzt sowohl einen Zeilenindex als auch einen Spaltenindex.

In [22]:
data = {'state': ['Ohio', 'Ohio', 'Ohio', 'Nevada', 'Nevada'], 'year': [2000,2001,2002, 2001,2002], 'pop': [1.5, 1.7, 3.6, 2.4, 2.9]}
data

{'state': ['Ohio', 'Ohio', 'Ohio', 'Nevada', 'Nevada'],
 'year': [2000, 2001, 2002, 2001, 2002],
 'pop': [1.5, 1.7, 3.6, 2.4, 2.9]}

In [25]:
df = pd.DataFrame(data)
df

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9

In [26]:
df['state'] # Spalte extrahieren

0      Ohio
1      Ohio
2      Ohio
3    Nevada
4    Nevada
Name: state, dtype: object

In [27]:
df.year # Andere Möglichkeit, eine Spalte zu extrahieren

0    2000
1    2001
2    2002
3    2001
4    2002
Name: year, dtype: int64

In [29]:
frame2 = pd.DataFrame(data, columns=['year', 'state', 'pop', 'debt'], index=['one', 'two', 'three', 'four', 'five'])
frame2 # Zeilenindex gesetzt und Spalte hinzugefügt, ohne Werte

       year   state  pop debt
one    2000    Ohio  1.5  NaN
two    2001    Ohio  1.7  NaN
three  2002    Ohio  3.6  NaN
four   2001  Nevada  2.4  NaN
five   2002  Nevada  2.9  NaN

In [32]:
frame2.loc['three'] # Zeile auswählen

year     2002
state    Ohio
pop       3.6
debt      NaN
Name: three, dtype: object